#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.8`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.local_file.file_system_prompt: Reading...[0m[0m
[0m[1mdata.local_file.file_system_prompt: Read complete after 0s [id=1b64caca607e392bc85ff27243e6022401cc3184][0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.key_vault_ingestion.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group_consumption: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg][0m
[0m[1mmodule.data_factory.data.azurerm_subscription.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group_monitoring: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-mntrng-rg][0m
[0m[1mmodule.key_vault_ingestion.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.storage_account_function.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.storage_account_function.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mazurerm_resource_group.resource_group_ingestion: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault_consumption.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.key_vault_consumption.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_factory.data.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0][0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-mntrng-rg/providers/Microsoft.Insights/components/bfr-dev-appi001][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.key_vault_ingestion.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-ngst-kv001][0m
[0m[1mmodule.data_factory.azurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.DataFactory/factories/bfr-dev-adf001][0m
[0m[1mmodule.storage_account_function.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Storage/storageAccounts/bfrdevflxfncstg001][0m
[0m[1mmodule.user_assigned_identity_ingestion.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/bfr-dev-ngst-uai001][0m
[0m[1mmodule.storage_account.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Storage/storageAccounts/bfrdevstg001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.app_service_plan_ingestion.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Web/serverFarms/bfr-dev-ngst-asp001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mazapi_resource.subnet_web_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/WebAppSubnetBot][0m
[0m[1mmodule.key_vault_consumption.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-kv001][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mmodule.cosmosdb_account.azurerm_cosmosdb_account.cosmosdb_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.DocumentDB/databaseAccounts/bfr-dev-cosmos001][0m
[0m[1mmodule.azure_open_ai.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.CognitiveServices/accounts/bfr-dev-aoai001][0m
[0m[1mmodule.app_service_plan_consumption.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Web/serverFarms/bfr-dev-asp001][0m
[0m[1mmodule.user_assigned_identity_consumption.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/bfr-dev-uai001][0m
[0m[1mmodule.key_vault_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.key_vault_consumption.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-kv001/providers/Microsoft.Authorization/roleAssignments/4376e04b-a9cb-1902-d225-46efb4f04a1e][0m
[0m[1mmodule.key_vault_ingestion.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-ngst-kv001/providers/Microsoft.Authorization/roleAssignments/e1f0c0c3-b814-2e59-4c03-d20d18434d43][0m
[0m[1mmodule.key_vault_ingestion.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.key_vault_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-kv001][0m
[0m[1mmodule.app_service_plan_ingestion.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Web/serverFarms/bfr-dev-ngst-asp001|applicationLogs-0][0m
[0m[1mmodule.data_factory.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory: Reading...[0m[0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PrivateEndpointSubnetBot][0m
[0m[1mmodule.key_vault_ingestion.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-ngst-kv001][0m
[0m[1mazurerm_role_assignment.uai_ngst_roleassignment_key_vault_secrets_officer: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-ngst-kv001/providers/Microsoft.Authorization/roleAssignments/862b5fa5-f037-c66a-8c4c-81ff9cbaaa72][0m
[0m[1mmodule.app_service_plan_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Reading...[0m[0m
[0m[1mmodule.data_factory.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.DataFactory/factories/bfr-dev-adf001][0m
[0m[1mmodule.key_vault_consumption.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-kv001|applicationLogs-0][0m
[0m[1mazurerm_role_assignment.data_factory_roleassignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-ngst-kv001/providers/Microsoft.Authorization/roleAssignments/311c4932-2d34-a37e-b390-7046543c5cfe][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.key_vault_ingestion.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-ngst-kv001|applicationLogs-0][0m
[0m[1mmodule.data_factory.azurerm_monitor_diagnostic_setting.diagnostic_setting_data_factory["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.DataFactory/factories/bfr-dev-adf001|applicationLogs-0][0m
[0m[1mmodule.app_service_plan_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Web/serverFarms/bfr-dev-asp001][0m
[0m[1mazurerm_role_assignment.uai_cnsm_roleassignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-kv001/providers/Microsoft.Authorization/roleAssignments/fbc7be03-89be-a359-fe7f-b7440b79fe30][0m
[0m[1mazurerm_role_assignment.uai_ngst_roleassignment_open_ai_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.CognitiveServices/accounts/bfr-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/0b68715b-99c7-4863-cdf5-1a1d9812ffe5][0m
[0m[1mazurerm_role_assignment.uai_cnsm_roleassignment_open_ai_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.CognitiveServices/accounts/bfr-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/824dc039-baf7-77c9-331a-d04a48f9a76f][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.CognitiveServices/accounts/bfr-dev-aoai001][0m
[0m[1mazurerm_cognitive_deployment.cognitive_deployment_gpt_4o: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.CognitiveServices/accounts/bfr-dev-aoai001/deployments/gpt-4o][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mmodule.app_service_plan_consumption.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Web/serverFarms/bfr-dev-asp001|applicationLogs-0][0m
[0m[1mmodule.cosmosdb_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cosmosdb_account: Reading...[0m[0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-mntrng-rg/providers/Microsoft.Insights/components/bfr-dev-appi001][0m
[0m[1mmodule.azure_open_ai.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.CognitiveServices/accounts/bfr-dev-aoai001|applicationLogs-0][0m
[0m[1mmodule.data_factory.azurerm_private_endpoint.data_factory_private_endpoint_data_factory: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Network/privateEndpoints/bfr-dev-adf001-datafactory-pe][0m
[0m[1mmodule.key_vault_ingestion.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Network/privateEndpoints/bfr-dev-ngst-kv001-vault-pe][0m
[0m[1mmodule.key_vault_consumption.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Network/privateEndpoints/bfr-dev-kv001-vault-pe][0m
[0m[1mmodule.cosmosdb_account.azurerm_private_endpoint.private_endpoint_cosmosdb_account["Sql"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Network/privateEndpoints/bfr-dev-cosmos001-Sql-pe][0m
[0m[1mmodule.cosmosdb_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cosmosdb_account: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.DocumentDB/databaseAccounts/bfr-dev-cosmos001][0m
[0m[1mmodule.azure_open_ai.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Network/privateEndpoints/bfr-dev-aoai001-account-pe][0m
[0m[1mazurerm_cosmosdb_sql_database.cosmosdb_sql_database: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.DocumentDB/databaseAccounts/bfr-dev-cosmos001/sqlDatabases/BotDb][0m
[0m[1mmodule.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-mntrng-rg/providers/Microsoft.Insights/components/bfr-dev-appi001|applicationLogs-0][0m
[0m[1mmodule.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Storage/storageAccounts/bfrdevstg001/providers/Microsoft.Authorization/roleAssignments/7e167171-4676-77b1-695b-883af6816b46][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Network/privateEndpoints/bfrdevstg001-blob-pe][0m
[0m[1mmodule.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Storage/storageAccounts/bfrdevstg001][0m
[0m[1mazurerm_role_assignment.data_factory_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Storage/storageAccounts/bfrdevstg001/providers/Microsoft.Authorization/roleAssignments/b29696e3-5b41-bb7f-b0dd-f3e61bb840c8][0m
[0m[1mazurerm_role_assignment.uai_ngst_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Storage/storageAccounts/bfrdevstg001/providers/Microsoft.Authorization/roleAssignments/bb0c1ec1-8133-4307-9108-3b17d9a19311][0m
[0m[1mmodule.bot_service.data.azurerm_application_insights.application_insights: Reading...[0m[0m
[0m[1mmodule.storage_account_function.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Storage/storageAccounts/bfrdevflxfncstg001/providers/Microsoft.Authorization/roleAssignments/148cc021-9bcc-72b5-6ba7-6dd0665b93e1][0m
[0m[1mmodule.storage_account_function.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Network/privateEndpoints/bfrdevflxfncstg001-blob-pe][0m
[0m[1mmodule.storage_account_function.azurerm_private_endpoint.private_endpoint_storage_account["file"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Network/privateEndpoints/bfrdevflxfncstg001-file-pe][0m
[0m[1mmodule.storage_account_function.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.bot_service.data.azurerm_application_insights.application_insights: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-mntrng-rg/providers/Microsoft.Insights/components/bfr-dev-appi001][0m
[0m[1mmodule.storage_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_storage_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Storage/storageAccounts/bfrdevstg001|applicationLogs-0][0m
[0m[1mmodule.data_factory.azurerm_data_factory_managed_private_endpoint.data_factory_managed_private_endpoints["keyvault-vault"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.DataFactory/factories/bfr-dev-adf001/managedVirtualNetworks/default/managedPrivateEndpoints/keyvault-vault][0m
[0m[1mmodule.data_factory.azurerm_data_factory_managed_private_endpoint.data_factory_managed_private_endpoints["storage-blob"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.DataFactory/factories/bfr-dev-adf001/managedVirtualNetworks/default/managedPrivateEndpoints/storage-blob][0m
[0m[1mazurerm_role_assignment.uai_ngst_roleassignment_storage_function_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Storage/storageAccounts/bfrdevflxfncstg001/providers/Microsoft.Authorization/roleAssignments/014d5996-1456-a920-79b9-8d69498c86e4][0m
[0m[1mmodule.key_vault_ingestion.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-01T12:00:53Z][0m
[0m[1mmodule.data_factory.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-01T12:00:53Z][0m
[0m[1mmodule.azure_open_ai.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-01T11:59:20Z][0m
[0m[1mmodule.cosmosdb_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-01T12:10:02Z][0m
[0m[1mmodule.key_vault_consumption.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-01T12:00:53Z][0m
[0m[1mazurerm_linux_web_app.linux_web_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Web/sites/bfr-dev-app001][0m
[0m[1mmodule.storage_account_function.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Storage/storageAccounts/bfrdevflxfncstg001][0m
[0m[1mmodule.storage_account_function.azurerm_monitor_diagnostic_setting.diagnostic_setting_storage_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Storage/storageAccounts/bfrdevflxfncstg001|applicationLogs-0][0m
[0m[1mmodule.data_factory.null_resource.data_factory_managed_private_endpoint_storage_blob_approval["keyvault-vault"]: Refreshing state... [id=6535260484567379940][0m
[0m[1mmodule.data_factory.null_resource.data_factory_managed_private_endpoint_storage_blob_approval["storage-blob"]: Refreshing state... [id=2792598835111476888][0m
[0m[1mmodule.storage_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-01T12:01:54Z][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["curated"]: Refreshing state... [id=https://bfrdevstg001.blob.core.windows.net/curated][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["raw"]: Refreshing state... [id=https://bfrdevstg001.blob.core.windows.net/raw][0m
[0m[1mmodule.storage_account_function.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-04T07:18:18Z][0m
[0m[1mmodule.storage_account_function.azurerm_storage_container.storage_container["code"]: Refreshing state... [id=https://bfrdevflxfncstg001.blob.core.windows.net/code][0m
[0m[1mazurerm_private_endpoint.linux_web_app_private_endpoint: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Network/privateEndpoints/bfr-dev-app001-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_linux_web_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Web/sites/bfr-dev-app001|logAnalytics][0m
[0m[1mmodule.bot_service.azurerm_bot_service_azure_bot.bot_service_azure_bot: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.BotService/botServices/bfr-dev-bot001][0m
[0m[1mmodule.bot_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_bot_service_azure_bot: Reading...[0m[0m
[0m[1mazurerm_bot_connection.bot_connection_aadv2_oauth: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.BotService/botServices/bfr-dev-bot001/connections/aadv2-oauth][0m
[0m[1mmodule.bot_service.azurerm_private_endpoint.bot_service_azure_bot_private_endpoint_token: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Network/privateEndpoints/bfr-dev-bot001-token-pe][0m
[0m[1mmodule.bot_service.azurerm_private_endpoint.bot_service_azure_bot_private_endpoint_bot: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Network/privateEndpoints/bfr-dev-bot001-bot-pe][0m
[0m[1mmodule.bot_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_bot_service_azure_bot: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.BotService/botServices/bfr-dev-bot001][0m
[0m[1mmodule.bot_service.azurerm_monitor_diagnostic_setting.diagnostic_setting_bot_service_azure_bot["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.BotService/botServices/bfr-dev-bot001|applicationLogs-0][0m
[0m[1mmodule.bot_service.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-01T12:04:53Z][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_linux_web_app[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_linux_web_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Web/sites/bfr-dev-app001"
    }

[1m  # azapi_resource.linux_function_app_flex[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "linux_function_app_flex" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m kind       = "functionapp,linux"
          [32m+[0m[0m properties = {
              [32m+[0m[0m autoGeneratedDomainNameLabelScope = "TenantReuse"
              [32m+[0m[0m clientAffinityEnabled             = false
              [32m+[0m[0m clientCertEnabled                 = false
              [32m+[0m[0m clientCertExclusionPaths          = [90mnull[0m[0m
              [32m+[0m[0m clientCertMode                    = "Required"
              [32m+[0m[0m dailyMemoryTimeQuota              = 0
              [32m+[0m[0m daprConfig                        = [90mnull[0m[0m
              [32m+[0m[0m dnsConfiguration                  = {}
              [32m+[0m[0m enabled                           = true
              [32m+[0m[0m endToEndEncryptionEnabled         = true
              [32m+[0m[0m functionAppConfig                 = {
                  [32m+[0m[0m deployment          = {
                      [32m+[0m[0m storage = {
                          [32m+[0m[0m authentication = {
                              [32m+[0m[0m type                           = "UserAssignedIdentity"
                              [32m+[0m[0m userAssignedIdentityResourceId = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/bfr-dev-ngst-uai001"
                            }
                          [32m+[0m[0m type           = "blobContainer"
                          [32m+[0m[0m value          = "https://bfrdevflxfncstg001.blob.core.windows.net//code"
                        }
                    }
                  [32m+[0m[0m runtime             = {
                      [32m+[0m[0m name    = "python"
                      [32m+[0m[0m version = "3.11"
                    }
                  [32m+[0m[0m scaleAndConcurrency = {
                      [32m+[0m[0m alwaysReady          = []
                      [32m+[0m[0m instanceMemoryMB     = 2048
                      [32m+[0m[0m maximumInstanceCount = 10
                      [32m+[0m[0m triggers             = {
                          [32m+[0m[0m http = {
                              [32m+[0m[0m perInstanceConcurrency = 5
                            }
                        }
                    }
                }
              [32m+[0m[0m hostNameSslStates                 = []
              [32m+[0m[0m hostNamesDisabled                 = false
              [32m+[0m[0m httpsOnly                         = true
              [32m+[0m[0m hyperV                            = false
              [32m+[0m[0m ipMode                            = "IPv4"
              [32m+[0m[0m keyVaultReferenceIdentity         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/bfr-dev-ngst-uai001"
              [32m+[0m[0m publicNetworkAccess               = "Enabled"
              [32m+[0m[0m redundancyMode                    = [90mnull[0m[0m
              [32m+[0m[0m scmSiteAlsoStopped                = false
              [32m+[0m[0m serverFarmId                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Web/serverFarms/bfr-dev-ngst-asp001"
              [32m+[0m[0m siteConfig                        = {
                  [32m+[0m[0m appSettings                            = [
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "AzureWebJobsStorage__accountName"
                          [32m+[0m[0m value = "bfrdevflxfncstg001"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "AzureWebJobsStorage__credential"
                          [32m+[0m[0m value = "managedidentity"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "AzureWebJobsStorage__clientId"
                          [32m+[0m[0m value = "42a1dff3-42d6-4942-9320-8deac65363ba"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "APPLICATIONINSIGHTS_CONNECTION_STRING"
                          [32m+[0m[0m value = (sensitive value)
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "MANAGED_IDENTITY_CLIENT_ID"
                          [32m+[0m[0m value = "42a1dff3-42d6-4942-9320-8deac65363ba"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "AzureWebJobsSecretStorageType"
                          [32m+[0m[0m value = "keyvault"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "AzureWebJobsSecretStorageKeyVaultUri"
                          [32m+[0m[0m value = "https://bfr-dev-ngst-kv001.vault.azure.net/"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "AzureWebJobsSecretStorageKeyVaultClientId"
                          [32m+[0m[0m value = "42a1dff3-42d6-4942-9320-8deac65363ba"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "AZURE_FUNCTIONS_ENVIRONMENT"
                          [32m+[0m[0m value = "Production"
                        },
                    ]
                  [32m+[0m[0m detailedErrorLoggingEnabled            = true
                  [32m+[0m[0m functionsRuntimeScaleMonitoringEnabled = true
                  [32m+[0m[0m healthCheckPath                        = [90mnull[0m[0m
                  [32m+[0m[0m http20Enabled                          = true
                  [32m+[0m[0m httpLoggingEnabled                     = true
                  [32m+[0m[0m ipSecurityRestrictions                 = []
                  [32m+[0m[0m ipSecurityRestrictionsDefaultAction    = "Allow"
                  [32m+[0m[0m keyVaultReferenceIdentity              = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/bfr-dev-ngst-uai001"
                  [32m+[0m[0m loadBalancing                          = "LeastRequests"
                  [32m+[0m[0m localMySqlEnabled                      = false
                  [32m+[0m[0m minTlsVersion                          = "1.3"
                  [32m+[0m[0m publicNetworkAccess                    = "Enabled"
                  [32m+[0m[0m remoteDebuggingEnabled                 = false
                  [32m+[0m[0m requestTracingEnabled                  = true
                  [32m+[0m[0m scmIpSecurityRestrictions              = []
                  [32m+[0m[0m scmIpSecurityRestrictionsDefaultAction = "Allow"
                  [32m+[0m[0m scmIpSecurityRestrictionsUseMain       = false
                  [32m+[0m[0m scmMinTlsVersion                       = "1.3"
                  [32m+[0m[0m scmType                                = "None"
                  [32m+[0m[0m webSocketsEnabled                      = false
                  [32m+[0m[0m websiteTimeZone                        = "UTC"
                }
              [32m+[0m[0m storageAccountRequired            = true
              [32m+[0m[0m virtualNetworkSubnetId            = (known after apply)
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = false
      [32m+[0m[0m location                  = "northeurope"
      [32m+[0m[0m locks                     = []
      [32m+[0m[0m name                      = "bfr-dev-fctn001"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg"
      [32m+[0m[0m response_export_values    = [
          [32m+[0m[0m "*",
        ]
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
      [32m+[0m[0m type                      = "Microsoft.Web/sites@2024-04-01"

      [32m+[0m[0m identity {
          [32m+[0m[0m identity_ids = [
              [32m+[0m[0m "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/bfr-dev-uai001",
            ]
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "UserAssigned"
        }
    }

[1m  # azapi_resource.subnet_function[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "subnet_function" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m properties = {
              [32m+[0m[0m addressPrefix                     = "10.3.1.128/26"
              [32m+[0m[0m delegations                       = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name       = "FunctionDelegation"
                      [32m+[0m[0m properties = {
                          [32m+[0m[0m serviceName = "Microsoft.App/environments"
                        }
                    },
                ]
              [32m+[0m[0m ipAllocations                     = []
              [32m+[0m[0m networkSecurityGroup              = {
                  [32m+[0m[0m id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001"
                }
              [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
              [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
              [32m+[0m[0m routeTable                        = {
                  [32m+[0m[0m id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001"
                }
              [32m+[0m[0m serviceEndpointPolicies           = []
              [32m+[0m[0m serviceEndpoints                  = []
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m name                      = "FunctionAppSubnetBot"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001"
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # azurerm_linux_web_app.linux_web_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_linux_web_app" "linux_web_app" {
      [33m~[0m[0m app_settings                                   = {
          [33m~[0m[0m "AZURE_OPENAI_SYSTEM_PROMPT"                 = <<-EOT
                You are a world-class assistant who tells jokes. For anything but jokes, respond politely that you are just trying to make everyone’s life a happier place.
            EOT
            [90m# (18 unchanged elements hidden)[0m[0m
        }
        id                                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Web/sites/bfr-dev-app001"
        name                                           = "bfr-dev-app001"
        tags                                           = {
            "workload" = "bot-assistant"
        }
        [90m# (24 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_linux_web_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_linux_web_app" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-cnsm-rg/providers/Microsoft.Web/sites/bfr-dev-app001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.app_service_plan_ingestion.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_service_plan" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Web/serverFarms/bfr-dev-ngst-asp001"
    }

[1m  # module.app_service_plan_ingestion.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_service_plan" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Web/serverFarms/bfr-dev-ngst-asp001|applicationLogs-0"
        name                           = "applicationLogs-0"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.app_service_plan_ingestion.azurerm_service_plan.service_plan[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_service_plan" "service_plan" {
        id                           = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-ngst-rg/providers/Microsoft.Web/serverFarms/bfr-dev-ngst-asp001"
        name                         = "bfr-dev-ngst-asp001"
        tags                         = {
            "workload" = "bot-assistant"
        }
      [33m~[0m[0m worker_count                 = 0 [33m->[0m[0m 1
        [90m# (10 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 2 to add, 4 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>